app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = 'Mermaid', "rating" = 'G', "director" = 'Angie Kollmer', "release_date" = '2013-11-10 00:00:00.000000', "updated_at" = '2013-11-10 19:07:22.282495' WHERE "movies"."id" = 1
---
  def update
  #debugger
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    # debugger
    # check whether the selected movie has director info
    # if not, go to home page and flash error
    movie = Movie.find params[:id]
    if movie.director == nil or movie.director == "" then
      flash[:notice] = "'#{movie.title}' has no director info."
      redirect_to movies_path and return
    else
      @movies = Movie.find_same_director(params[:id])